; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=103, out_folder=htg/blocksworld/training, instance_id=83, seed=2107, goal_proportion=0.1

(define (problem blocksworld-83)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 - object)
 (:init 
    (arm-empty)
    (clear b85)
    (on b85 b48)
    (on b48 b51)
    (on-table b51)
    (clear b102)
    (on b102 b37)
    (on b37 b90)
    (on-table b90)
    (clear b15)
    (on b15 b71)
    (on-table b71)
    (clear b62)
    (on b62 b33)
    (on b33 b103)
    (on b103 b84)
    (on b84 b20)
    (on b20 b32)
    (on b32 b52)
    (on b52 b94)
    (on b94 b25)
    (on-table b25)
    (clear b30)
    (on-table b30)
    (clear b69)
    (on-table b69)
    (clear b24)
    (on b24 b78)
    (on b78 b47)
    (on-table b47)
    (clear b80)
    (on b80 b44)
    (on-table b44)
    (clear b55)
    (on b55 b53)
    (on b53 b74)
    (on b74 b92)
    (on b92 b14)
    (on b14 b43)
    (on b43 b101)
    (on b101 b18)
    (on b18 b57)
    (on b57 b46)
    (on-table b46)
    (clear b3)
    (on-table b3)
    (clear b19)
    (on b19 b59)
    (on b59 b86)
    (on b86 b56)
    (on b56 b23)
    (on b23 b2)
    (on-table b2)
    (clear b63)
    (on b63 b89)
    (on-table b89)
    (clear b70)
    (on-table b70)
    (clear b31)
    (on-table b31)
    (clear b45)
    (on b45 b58)
    (on b58 b96)
    (on b96 b75)
    (on b75 b64)
    (on b64 b29)
    (on b29 b41)
    (on-table b41)
    (clear b1)
    (on-table b1)
    (clear b61)
    (on b61 b22)
    (on b22 b38)
    (on b38 b91)
    (on b91 b77)
    (on b77 b39)
    (on b39 b93)
    (on b93 b40)
    (on-table b40)
    (clear b99)
    (on b99 b9)
    (on b9 b50)
    (on b50 b54)
    (on-table b54)
    (clear b28)
    (on b28 b12)
    (on b12 b8)
    (on b8 b72)
    (on b72 b42)
    (on b42 b11)
    (on b11 b79)
    (on b79 b21)
    (on-table b21)
    (clear b83)
    (on b83 b60)
    (on b60 b7)
    (on-table b7)
    (clear b73)
    (on b73 b81)
    (on b81 b17)
    (on b17 b95)
    (on b95 b13)
    (on-table b13)
    (clear b97)
    (on-table b97)
    (clear b76)
    (on b76 b36)
    (on b36 b27)
    (on b27 b6)
    (on-table b6)
    (clear b34)
    (on-table b34)
    (clear b16)
    (on b16 b4)
    (on-table b4)
    (clear b10)
    (on b10 b68)
    (on-table b68)
    (clear b66)
    (on b66 b65)
    (on b65 b98)
    (on b98 b49)
    (on b49 b35)
    (on b35 b67)
    (on b67 b82)
    (on b82 b87)
    (on b87 b26)
    (on b26 b88)
    (on-table b88)
    (clear b5)
    (on b5 b100)
    (on-table b100))
 (:goal  (and 
    (clear b6)
    (on b6 b8)
    (on b8 b9)
    (on-table b9)
    (clear b7)
    (on b7 b10)
    (on b10 b4)
    (on b4 b5)
    (on b5 b1)
    (on-table b1)
    (clear b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b5 b100)
   deleted: (on b5 b100) (clear b5) (arm-empty)
   added: (holding b5) (clear b100)
   goals met: 2 of 13
2. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 3 of 13
3. (unstack b99 b9)
   deleted: (on b99 b9) (clear b99) (arm-empty)
   added: (holding b99) (clear b9)
   goals met: 3 of 13
4. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 3 of 13
5. (unstack b9 b50)
   deleted: (on b9 b50) (clear b9) (arm-empty)
   added: (holding b9) (clear b50)
   goals met: 3 of 13
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 13
7. (unstack b83 b60)
   deleted: (on b83 b60) (clear b83) (arm-empty)
   added: (holding b83) (clear b60)
   goals met: 4 of 13
8. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 4 of 13
9. (unstack b60 b7)
   deleted: (on b60 b7) (clear b60) (arm-empty)
   added: (holding b60) (clear b7)
   goals met: 5 of 13
10. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 5 of 13
11. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 13
12. (stack b7 b10)
   deleted: (clear b10) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b10)
   goals met: 6 of 13
13. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 6 of 13
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 6 of 13
15. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 13
16. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 7 of 13
17. (unstack b76 b36)
   deleted: (on b76 b36) (clear b76) (arm-empty)
   added: (holding b76) (clear b36)
   goals met: 7 of 13
18. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 7 of 13
19. (unstack b36 b27)
   deleted: (on b36 b27) (clear b36) (arm-empty)
   added: (holding b36) (clear b27)
   goals met: 7 of 13
20. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 7 of 13
21. (unstack b27 b6)
   deleted: (on b27 b6) (clear b27) (arm-empty)
   added: (holding b27) (clear b6)
   goals met: 8 of 13
22. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 8 of 13
23. (unstack b28 b12)
   deleted: (on b28 b12) (clear b28) (arm-empty)
   added: (holding b28) (clear b12)
   goals met: 8 of 13
24. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 8 of 13
25. (unstack b12 b8)
   deleted: (on b12 b8) (clear b12) (arm-empty)
   added: (holding b12) (clear b8)
   goals met: 8 of 13
26. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 8 of 13
27. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 13
28. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 9 of 13
29. (unstack b19 b59)
   deleted: (on b19 b59) (clear b19) (arm-empty)
   added: (holding b19) (clear b59)
   goals met: 9 of 13
30. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 9 of 13
31. (unstack b59 b86)
   deleted: (on b59 b86) (clear b59) (arm-empty)
   added: (holding b59) (clear b86)
   goals met: 9 of 13
32. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 9 of 13
33. (unstack b86 b56)
   deleted: (on b86 b56) (clear b86) (arm-empty)
   added: (holding b86) (clear b56)
   goals met: 9 of 13
34. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 9 of 13
35. (unstack b56 b23)
   deleted: (on b56 b23) (clear b56) (arm-empty)
   added: (holding b56) (clear b23)
   goals met: 9 of 13
36. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 9 of 13
37. (unstack b23 b2)
   deleted: (on b23 b2) (clear b23) (arm-empty)
   added: (holding b23) (clear b2)
   goals met: 10 of 13
38. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 10 of 13
39. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 13
40. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 11 of 13
41. (unstack b7 b10)
   deleted: (on b7 b10) (clear b7) (arm-empty)
   added: (holding b7) (clear b10)
   goals met: 9 of 13
42. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 10 of 13
43. (unstack b10 b68)
   deleted: (on b10 b68) (clear b10) (arm-empty)
   added: (holding b10) (clear b68)
   goals met: 10 of 13
44. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 11 of 13
45. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 13
46. (stack b7 b10)
   deleted: (clear b10) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b10)
   goals met: 12 of 13
47. (unstack b6 b8)
   deleted: (on b6 b8) (clear b6) (arm-empty)
   added: (holding b6) (clear b8)
   goals met: 10 of 13
48. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 11 of 13
49. (unstack b8 b72)
   deleted: (on b8 b72) (clear b8) (arm-empty)
   added: (holding b8) (clear b72)
   goals met: 11 of 13
50. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 12 of 13
51. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 11 of 13
52. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 13 of 13
